wrk/output/stage_5/2_put_wrk.txt
Running 30s test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 1.994ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.964ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.827ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.788ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.11ms    2.10ms  41.63ms   94.09%
    Req/Sec   264.35     72.78     0.89k    92.33%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.69ms
 75.000%    2.11ms
 90.000%    3.04ms
 99.000%   10.20ms
 99.900%   33.25ms
 99.990%   40.10ms
 99.999%   41.66ms
100.000%   41.66ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.286     0.000000            1         1.00
       1.070     0.100000         2003         1.11
       1.264     0.200000         4005         1.25
       1.416     0.300000         6007         1.43
       1.554     0.400000         7999         1.67
       1.688     0.500000        10012         2.00
       1.759     0.550000        11012         2.22
       1.832     0.600000        12011         2.50
       1.909     0.650000        13005         2.86
       1.998     0.700000        14002         3.33
       2.109     0.750000        15013         4.00
       2.171     0.775000        15508         4.44
       2.249     0.800000        15996         5.00
       2.341     0.825000        16496         5.71
       2.471     0.850000        16996         6.67
       2.673     0.875000        17497         8.00
       2.825     0.887500        17747         8.89
       3.041     0.900000        17996        10.00
       3.277     0.912500        18246        11.43
       3.635     0.925000        18496        13.33
       4.083     0.937500        18747        16.00
       4.331     0.943750        18872        17.78
       4.663     0.950000        18997        20.00
       5.111     0.956250        19121        22.86
       5.599     0.962500        19247        26.67
       6.087     0.968750        19371        32.00
       6.431     0.971875        19433        35.56
       6.871     0.975000        19497        40.00
       7.375     0.978125        19558        45.71
       8.003     0.981250        19621        53.33
       8.591     0.984375        19683        64.00
       9.023     0.985938        19714        71.11
       9.535     0.987500        19746        80.00
       9.935     0.989062        19777        91.43
      10.591     0.990625        19808       106.67
      11.463     0.992188        19839       128.00
      12.047     0.992969        19855       142.22
      12.791     0.993750        19871       160.00
      13.439     0.994531        19886       182.86
      14.223     0.995313        19902       213.33
      14.879     0.996094        19917       256.00
      15.615     0.996484        19925       284.44
      17.007     0.996875        19933       320.00
      17.903     0.997266        19941       365.71
      19.839     0.997656        19949       426.67
      23.359     0.998047        19956       512.00
      25.055     0.998242        19960       568.89
      26.351     0.998437        19964       640.00
      29.151     0.998633        19968       731.43
      31.471     0.998828        19972       853.33
      33.535     0.999023        19977      1024.00
      33.663     0.999121        19978      1137.78
      34.271     0.999219        19980      1280.00
      34.783     0.999316        19982      1462.86
      35.263     0.999414        19984      1706.67
      35.935     0.999512        19986      2048.00
      36.415     0.999561        19987      2275.56
      36.767     0.999609        19988      2560.00
      37.247     0.999658        19989      2925.71
      37.471     0.999707        19990      3413.33
      38.207     0.999756        19991      4096.00
      38.207     0.999780        19991      4551.11
      39.391     0.999805        19992      5120.00
      39.391     0.999829        19992      5851.43
      40.095     0.999854        19993      6826.67
      40.095     0.999878        19993      8192.00
      40.095     0.999890        19993      9102.22
      40.895     0.999902        19994     10240.00
      40.895     0.999915        19994     11702.86
      40.895     0.999927        19994     13653.33
      40.895     0.999939        19994     16384.00
      40.895     0.999945        19994     18204.44
      41.663     0.999951        19995     20480.00
      41.663     1.000000        19995          inf
#[Mean    =        2.106, StdDeviation   =        2.100]
#[Max     =       41.632, Total count    =        19995]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  30003 requests in 30.00s, 1.92MB read
  Non-2xx or 3xx responses: 1
Requests/sec:   1000.09
Transfer/sec:     65.44KB