wrk/output/stage_5/3_get_full_wrk.txt
Running 30s test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 2.234ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.231ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.085ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.223ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.93ms  807.93us  11.38ms   86.44%
    Req/Sec   263.42     58.21   666.00     58.06%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.81ms
 75.000%    2.15ms
 90.000%    2.58ms
 99.000%    5.66ms
 99.900%    8.75ms
 99.990%   10.85ms
 99.999%   11.39ms
100.000%   11.39ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.337     0.000000            1         1.00
       1.233     0.100000         2005         1.11
       1.416     0.200000         4007         1.25
       1.552     0.300000         6000         1.43
       1.680     0.400000         7998         1.67
       1.812     0.500000         9997         2.00
       1.871     0.550000        11014         2.22
       1.932     0.600000        12000         2.50
       1.995     0.650000        13004         2.86
       2.069     0.700000        13997         3.33
       2.153     0.750000        15013         4.00
       2.201     0.775000        15506         4.44
       2.251     0.800000        16016         5.00
       2.307     0.825000        16501         5.71
       2.373     0.850000        17003         6.67
       2.457     0.875000        17493         8.00
       2.517     0.887500        17753         8.89
       2.577     0.900000        17994        10.00
       2.661     0.912500        18248        11.43
       2.771     0.925000        18493        13.33
       2.893     0.937500        18745        16.00
       2.979     0.943750        18869        17.78
       3.071     0.950000        18995        20.00
       3.211     0.956250        19118        22.86
       3.359     0.962500        19245        26.67
       3.559     0.968750        19368        32.00
       3.711     0.971875        19431        35.56
       3.889     0.975000        19494        40.00
       4.029     0.978125        19555        45.71
       4.299     0.981250        19619        53.33
       4.623     0.984375        19680        64.00
       4.843     0.985938        19711        71.11
       5.127     0.987500        19743        80.00
       5.423     0.989062        19774        91.43
       5.807     0.990625        19805       106.67
       6.039     0.992188        19836       128.00
       6.207     0.992969        19852       142.22
       6.411     0.993750        19868       160.00
       6.567     0.994531        19883       182.86
       6.879     0.995313        19899       213.33
       7.115     0.996094        19914       256.00
       7.315     0.996484        19922       284.44
       7.455     0.996875        19930       320.00
       7.583     0.997266        19938       365.71
       7.755     0.997656        19947       426.67
       7.867     0.998047        19953       512.00
       7.911     0.998242        19957       568.89
       8.039     0.998437        19961       640.00
       8.239     0.998633        19965       731.43
       8.487     0.998828        19969       853.33
       8.783     0.999023        19973      1024.00
       8.847     0.999121        19975      1137.78
       9.039     0.999219        19977      1280.00
       9.135     0.999316        19979      1462.86
       9.687     0.999414        19981      1706.67
       9.839     0.999512        19983      2048.00
      10.079     0.999561        19984      2275.56
      10.279     0.999609        19985      2560.00
      10.359     0.999658        19986      2925.71
      10.631     0.999707        19987      3413.33
      10.671     0.999756        19988      4096.00
      10.671     0.999780        19988      4551.11
      10.767     0.999805        19989      5120.00
      10.767     0.999829        19989      5851.43
      10.855     0.999854        19990      6826.67
      10.855     0.999878        19990      8192.00
      10.855     0.999890        19990      9102.22
      11.191     0.999902        19991     10240.00
      11.191     0.999915        19991     11702.86
      11.191     0.999927        19991     13653.33
      11.191     0.999939        19991     16384.00
      11.191     0.999945        19991     18204.44
      11.391     0.999951        19992     20480.00
      11.391     1.000000        19992          inf
#[Mean    =        1.927, StdDeviation   =        0.808]
#[Max     =       11.384, Total count    =        19992]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  30001 requests in 30.00s, 2.03MB read
Requests/sec:   1000.06
Transfer/sec:     69.20KB