wrk/output/stage_5/4_delete_wrk.txt
Running 30s test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 2.084ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.717ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.948ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.828ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.93ms    0.86ms  13.83ms   90.45%
    Req/Sec   263.59     60.22   600.00     55.65%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.81ms
 75.000%    2.16ms
 90.000%    2.55ms
 99.000%    5.64ms
 99.900%   11.33ms
 99.990%   13.00ms
 99.999%   13.84ms
100.000%   13.84ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.371     0.000000            1         1.00
       1.264     0.100000         2002         1.11
       1.440     0.200000         4015         1.25
       1.572     0.300000         6010         1.43
       1.689     0.400000         8011         1.67
       1.813     0.500000        10012         2.00
       1.872     0.550000        11004         2.22
       1.935     0.600000        12010         2.50
       1.998     0.650000        13003         2.86
       2.077     0.700000        14011         3.33
       2.157     0.750000        15011         4.00
       2.203     0.775000        15505         4.44
       2.253     0.800000        16005         5.00
       2.305     0.825000        16501         5.71
       2.373     0.850000        16997         6.67
       2.457     0.875000        17501         8.00
       2.497     0.887500        17751         8.89
       2.547     0.900000        18001        10.00
       2.601     0.912500        18250        11.43
       2.661     0.925000        18497        13.33
       2.759     0.937500        18747        16.00
       2.815     0.943750        18872        17.78
       2.877     0.950000        18999        20.00
       2.957     0.956250        19126        22.86
       3.071     0.962500        19248        26.67
       3.227     0.968750        19372        32.00
       3.321     0.971875        19435        35.56
       3.445     0.975000        19497        40.00
       3.637     0.978125        19559        45.71
       3.927     0.981250        19622        53.33
       4.251     0.984375        19684        64.00
       4.519     0.985938        19715        71.11
       4.887     0.987500        19747        80.00
       5.335     0.989062        19779        91.43
       5.855     0.990625        19810       106.67
       6.291     0.992188        19840       128.00
       6.715     0.992969        19856       142.22
       7.047     0.993750        19872       160.00
       7.459     0.994531        19887       182.86
       7.839     0.995313        19903       213.33
       8.271     0.996094        19918       256.00
       8.551     0.996484        19926       284.44
       8.991     0.996875        19934       320.00
       9.223     0.997266        19942       365.71
       9.471     0.997656        19950       426.67
      10.311     0.998047        19957       512.00
      10.415     0.998242        19961       568.89
      10.535     0.998437        19965       640.00
      10.935     0.998633        19969       731.43
      11.167     0.998828        19973       853.33
      11.359     0.999023        19977      1024.00
      11.447     0.999121        19979      1137.78
      11.527     0.999219        19981      1280.00
      11.823     0.999316        19983      1462.86
      12.039     0.999414        19985      1706.67
      12.183     0.999512        19987      2048.00
      12.263     0.999561        19988      2275.56
      12.327     0.999609        19990      2560.00
      12.327     0.999658        19990      2925.71
      12.623     0.999707        19991      3413.33
      12.695     0.999756        19992      4096.00
      12.695     0.999780        19992      4551.11
      12.935     0.999805        19993      5120.00
      12.935     0.999829        19993      5851.43
      12.999     0.999854        19994      6826.67
      12.999     0.999878        19994      8192.00
      12.999     0.999890        19994      9102.22
      13.439     0.999902        19995     10240.00
      13.439     0.999915        19995     11702.86
      13.439     0.999927        19995     13653.33
      13.439     0.999939        19995     16384.00
      13.439     0.999945        19995     18204.44
      13.839     0.999951        19996     20480.00
      13.839     1.000000        19996          inf
#[Mean    =        1.931, StdDeviation   =        0.859]
#[Max     =       13.832, Total count    =        19996]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  29754 requests in 30.00s, 1.93MB read
Requests/sec:    991.74
Transfer/sec:     65.86KB